cmsis-svd/cmsis-svd/data/Fujitsu/MB9AF42xK.svd
        <!-- REGISTER "IF1MSK1" -->
        <register>
          <name>IF1MSK1</name>
          <description>IF1 Mask Registers 1</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MSK15" -->
            <field>
              <name>MSK15</name>
              <description>Msk15</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK14" -->
            <field>
              <name>MSK14</name>
              <description>Msk14</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK13" -->
            <field>
              <name>MSK13</name>
              <description>Msk13</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK12" -->
            <field>
              <name>MSK12</name>
              <description>Msk12</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK11" -->
            <field>
              <name>MSK11</name>
              <description>Msk11</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK10" -->
            <field>
              <name>MSK10</name>
              <description>Msk10</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK9" -->
            <field>
              <name>MSK9</name>
              <description>Msk9</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK8" -->
            <field>
              <name>MSK8</name>
              <description>Msk8</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK7" -->
            <field>
              <name>MSK7</name>
              <description>Msk7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK6" -->
            <field>
              <name>MSK6</name>
              <description>Msk6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK5" -->
            <field>
              <name>MSK5</name>
              <description>Msk5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK4" -->
            <field>
              <name>MSK4</name>
              <description>Msk4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK3" -->
            <field>
              <name>MSK3</name>
              <description>Msk3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK2" -->
            <field>
              <name>MSK2</name>
              <description>Msk2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK1" -->
            <field>
              <name>MSK1</name>
              <description>Msk1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK0" -->
            <field>
              <name>MSK0</name>
              <description>Msk0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1MSK2" -->
        <register>
          <name>IF1MSK2</name>
          <description>IF1 Mask Registers 2</description>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xDFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MXTD" -->
            <field>
              <name>MXTD</name>
              <description>MXtd</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MDIR" -->
            <field>
              <name>MDIR</name>
              <description>MDir</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK28" -->
            <field>
              <name>MSK28</name>
              <description>Msk28</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK27" -->
            <field>
              <name>MSK27</name>
              <description>Msk27</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK26" -->
            <field>
              <name>MSK26</name>
              <description>Msk26</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK25" -->
            <field>
              <name>MSK25</name>
              <description>Msk25</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK24" -->
            <field>
              <name>MSK24</name>
              <description>Msk24</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK23" -->
            <field>
              <name>MSK23</name>
              <description>Msk23</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK22" -->
            <field>
              <name>MSK22</name>
              <description>Msk22</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK21" -->
            <field>
              <name>MSK21</name>
              <description>Msk21</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK20" -->
            <field>
              <name>MSK20</name>
              <description>Msk20</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK19" -->
            <field>
              <name>MSK19</name>
              <description>Msk19</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK18" -->
            <field>
              <name>MSK18</name>
              <description>Msk18</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK17" -->
            <field>
              <name>MSK17</name>
              <description>Msk17</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK16" -->
            <field>
              <name>MSK16</name>
              <description>Msk16</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1ARB1" -->
        <register>
          <name>IF1ARB1</name>
          <description>IF1 Arbitration Registers 1</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ID15" -->
            <field>
              <name>ID15</name>
              <description>ID15</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID14" -->
            <field>
              <name>ID14</name>
              <description>ID14</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID13" -->
            <field>
              <name>ID13</name>
              <description>ID13</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID12" -->
            <field>
              <name>ID12</name>
              <description>ID12</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID11" -->
            <field>
              <name>ID11</name>
              <description>ID11</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID10" -->
            <field>
              <name>ID10</name>
              <description>ID10</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID9" -->
            <field>
              <name>ID9</name>
              <description>ID9</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID8" -->
            <field>
              <name>ID8</name>
              <description>ID8</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID7" -->
            <field>
              <name>ID7</name>
              <description>ID7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID6" -->
            <field>
              <name>ID6</name>
              <description>ID6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID5" -->
            <field>
              <name>ID5</name>
              <description>ID5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID4" -->
            <field>
              <name>ID4</name>
              <description>ID4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID3" -->
            <field>
              <name>ID3</name>
              <description>ID3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID2" -->
            <field>
              <name>ID2</name>
              <description>ID2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID1" -->
            <field>
              <name>ID1</name>
              <description>ID1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID0" -->
            <field>
              <name>ID0</name>
              <description>ID0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1ARB2" -->
        <register>
          <name>IF1ARB2</name>
          <description>IF1 Arbitration Registers 2</description>
          <addressOffset>0x1A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MSGVAL" -->
            <field>
              <name>MSGVAL</name>
              <description>MsgVal</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "XTD" -->
            <field>
              <name>XTD</name>
              <description>Xtd</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIR" -->
            <field>
              <name>DIR</name>
              <description>Dir</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID28" -->
            <field>
              <name>ID28</name>
              <description>ID28</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID27" -->
            <field>
              <name>ID27</name>
              <description>ID27</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID26" -->
            <field>
              <name>ID26</name>
              <description>ID26</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID25" -->
            <field>
              <name>ID25</name>
              <description>ID25</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID24" -->
            <field>
              <name>ID24</name>
              <description>ID24</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID23" -->
            <field>
              <name>ID23</name>
              <description>ID23</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID22" -->
            <field>
              <name>ID22</name>
              <description>ID22</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID21" -->
            <field>
              <name>ID21</name>
              <description>ID21</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID20" -->
            <field>
              <name>ID20</name>
              <description>ID20</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID19" -->
            <field>
              <name>ID19</name>
              <description>ID19</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID18" -->
            <field>
              <name>ID18</name>
              <description>ID18</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID17" -->
            <field>
              <name>ID17</name>
              <description>ID17</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID16" -->
            <field>
              <name>ID16</name>
              <description>ID16</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
